#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform-scripts relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/quarkiverse-devops/quarkiverse-devops/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/quarkiverse-devops/quarkiverse-devops

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-RfU454B3aAX7zFeN

Waiting for the plan to start...

Terraform v1.9.2
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.quarkus_mailpit will be updated in-place
  ~ resource "github_repository" "quarkus_mailpit" {
      ~ description                 = "Email and SMTP testing tool with API for developers" -> "An email and SMTP testing tool with API for developers"
        id                          = "quarkus-mailpit"
        name                        = "quarkus-mailpit"
      ~ topics                      = [
          - "email",
          - "smtp-server",
            # (1 unchanged element hidden)
        ]
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_openfga_client will be updated in-place
  ~ resource "github_repository" "quarkus_openfga_client" {
      - allow_update_branch         = true -> null
        id                          = "quarkus-openfga-client"
        name                        = "quarkus-openfga-client"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_playpen will be created
  + resource "github_repository" "quarkus_playpen" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Live local development on a deployed k8s service"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + homepage_url                = "https://docs.quarkiverse.io/quarkus-playpen/dev"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "quarkus-playpen"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "kubernetes",
          + "local-dev-k8s",
          + "operator",
          + "quarkus-extension",
          + "remote-dev-k8s",
        ]
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_team.quarkus_playpen will be created
  + resource "github_team" "quarkus_playpen" {
      + create_default_maintainer = false
      + description               = "playpen team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "quarkiverse-playpen"
      + node_id                   = (known after apply)
      + parent_team_id            = "5344029"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.quarkus_playpen["patriot1burke"] will be created
  + resource "github_team_membership" "quarkus_playpen" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "patriot1burke"
    }

  # github_team_repository.quarkus_playpen will be created
  + resource "github_team_repository" "quarkus_playpen" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "quarkus-playpen"
      + team_id    = (known after apply)
    }

Plan: 4 to add, 2 to change, 0 to destroy.

```

*Pusher: @gastaldi, Action: `pull_request`, Workflow: `Terraform`*